Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Returns the string necessary for grammatically correct pluralization of the given resource ID for the given quantity.
zh_cn: 返回给定数量的给定资源 ID 的语法正确复数形式所需的字符串。

source: Returns the time elapsed since the beginning of the scrolling.
zh_cn: 返回自滚动开始以来经过的时间。

source: Returns the title of this toolbar.
zh_cn: 返回此工具栏的标题。

source: Returns the top edge of the given child view within its parent, offset by any applied ItemDecorations.
zh_cn: 返回给定的子 view 的上边，偏移自应用的 ItemDecorations。

source: Returns the total height of item decorations applied to child's bottom.
zh_cn: 返回应用于子 view 底部的 item decorations 的总高度。

source: Returns the total height of item decorations applied to child's top.
zh_cn: 返回应用于子 view 顶部的所有装饰的总宽度。

source: Returns the total number of items in the data set held by the adapter.
zh_cn: 返回适配器保存的数据集中的项目总数。

source: Returns the total width of item decorations applied to child's left.
zh_cn: 返回应用于子 view 左边的所有 item decorations 的总宽度。

source: Returns the total width of item decorations applied to child's right.
zh_cn: 返回应用于子 view 右边的所有装饰的总宽度。

source: Returns true if RecyclerView is attached to window.
zh_cn: 返回 true，如果 RecyclerView 已附加到窗口。

source: Returns true if RecyclerView is currently running some animations.
zh_cn: 返回 true，如果 RecyclerView 正在运行动画。

source: Returns true if layout and scroll are frozen.
zh_cn: 返回 true，如果当前布局和滚动被冻结。

source: Returns true if more input could change a positive match into a negative one.
zh_cn: 如果更多输入可以将正匹配更改为负匹配，则返回 true。

source: Returns true if nested scrolling is enabled for this view.
zh_cn: 返回 true，如果嵌套滚动可用。

source: Returns true if one or more observers are attached to this adapter.
zh_cn: 如果一个或多个观察者附加到此适配器，则返回 true。

source: Returns true if the RecyclerView should attempt to preserve currently focused Adapter Item's focus even if the View representing the Item is replaced during a layout calculation.
zh_cn: 返回 true，如果 RecyclerView 应该尝试保留当前获取焦点的 Adapter item 的焦点事件，如果呈现该 item 的 view 在布局计算中被替换。

source: Returns true if the RecyclerView this LayoutManager is bound to has focus.
zh_cn: 返回 true，如果该 LayoutManager 绑定的 RecyclerView 拥有焦点。

source: Returns true if the RecyclerView this LayoutManager is bound to has or contains focus.
zh_cn: 所回 true，如果 LayoutManager 绑定的 RecyclerView 拥有或包含焦点。

source: Returns true if the end of input was hit by the search engine in the last match operation performed by this matcher.
zh_cn: 如果匹配器执行的最后匹配操作中搜索引擎遇到输入结尾，则返回 true。

source: Returns true if the filltype is one of the INVERSE variants
zh_cn: 如果 filltype 是 INVERSE 变体之一，则返回 true

source: Returns true if the path is empty (contains no lines or curves)
zh_cn: 如果路径为空(不包含行或曲线)，则返回 true

source: Returns true if the path specifies a rectangle.
zh_cn: 如果路径指定矩形，则返回 true。

source: Returns true if the specified object represents an annotation that is logically equivalent to this one.
zh_cn: 如果指定的对象表示一个逻辑上等效于此的注解，则返回 true 。

source: Returns true if this adapter publishes a unique long value that can act as a key for the item at a given position in the data set.
zh_cn: 如果此适配器发布一个唯一的 long 值，该值可以作为数据集中给定位置项的键，则返回 true。

source: Returns true if this region decoder has been recycled.
zh_cn: 如果此区域解码器已被回收，则返回 true。

source: Returns true if this view has a nested scrolling parent.
zh_cn: 返回 true，如果该 view 有嵌套滚动的 parent。

source: Returns where the scroll will end.
zh_cn: 返回滚动结束的位置。

source: Returns whether LayoutManager is currently attached to a RecyclerView which is attached to a window.
zh_cn: 返回 LayoutManagr 当前是否附着一个附着到窗口的 RecyclerView。

source: Returns whether RecyclerView is currently computing a layout.
zh_cn: 返回 RecyclerView 当前是否在计算布局。

source: Returns whether results of getSpanIndex(int, int) method are cached or not.
zh_cn: 返回 getSpanIndex(int, int) 方法的返回结果是否是缓存的。

source: Returns whether the AppBarLayout lifts on scroll or not.
zh_cn: 返回 AppBarLayout 是否在滚动时抬起。

source: Returns whether the LayoutManager uses the automatic measurement API or not.
zh_cn: 返回 LayoutManager 是否使用自动测量的 API。

source: Returns whether the current Scroller is currently returning to a valid position.
zh_cn: 返回当前 Scroller 当前是否返回有效位置。

source: Returns whether the scroller has finished scrolling.
zh_cn: 返回滚动是否已完成滚动。

source: Returns whether there are pending adapter updates which are not yet applied to the layout.
zh_cn: 返回是否有未完成的还没有应用到布局上的 adapter 更新事件。Returns whether there are pending adapter updates which are not yet applied to the layout.

source: Returns whether views are laid out in reverse order or not.
zh_cn: 返回是否 views 是按逆序进行布局。

source: Reuse resources
zh_cn: 重用资源

source: Rewinds the path: clears any lines and curves from the path but keeps the internal data structure for faster reuse.
zh_cn: 回退路径：清除路径中的所有行和曲线，但保留内部数据结构以便更快地重用。

source: Right click on a WebP image in the Android Studio, then click Convert to PNG.
zh_cn: 右键单击 Android Studio 中的 WebP 图像，然后单击 Convert to PNG。

source: Right click on an image file or a folder containing a number of images files, and then click Convert to WebP.
zh_cn: 右键单击图像文件或包含许多图像文件的文件夹，然后单击 Convert to WebP。

source: Ripple color / press state color can be specified using the app:rippleColor attribute.
zh_cn: 可以使用 app:rippleColor 属性指定波纹颜色/按下状态颜色。

source: Ripple opacity will be determined by the Android framework when available.
zh_cn: Ripple 不透明度将由 Android 框架确定。

source: Row and Column Specs
zh_cn: 行和列规格

source: Row and column groups that sit either side of a common boundary are instead considered to act in series.
zh_cn: 位于公共边界两侧的行和列组被认为在 series (系列) 中起作用。

source: Running the CPU Profiler reveals that the callApplicationOnCreate() method eventually calls your com.example.customApplication.onCreate method.
zh_cn: 运行 CPU Profiler 会显示 callApplicationOnCreate() 方法最终会调用 com.example.customApplication.onCreate 方法。

source: SDK users will probably not need to use this class.
zh_cn: SDK 用户可能不需要使用此类。

source: START aligns the result to the left and top edges of dst.
zh_cn: START 将结果与 dst 的左边和上边对齐。

source: Same as EVEN_ODD, but draws outside of the path, rather than inside.
zh_cn: 与 EVEN_ODD 相同，但是在路径之外而不是在内部。

source: Same as WINDING, but draws outside of the path, rather than inside.
zh_cn: 与 WINDING 相同，但是在路径之外而不是在内部。

source: Same as cubicTo, but the coordinates are considered relative to the current point on this contour.
zh_cn: 与 cubicTo 相同，但坐标被认为是相对于此轮廓上的当前点。

source: Same as lineTo, but the coordinates are considered relative to the last point on this contour.
zh_cn: 与 lineTo 相同，但坐标被认为是相对于此轮廓上的最后一个点。

source: Same as quadTo, but the coordinates are considered relative to the last point on this contour.
zh_cn: 与 quadTo 相同，但坐标被认为是相对于此轮廓上的最后一个点。

source: Save any instance state associated with this adapter and its pages that should be restored if the current UI state needs to be reconstructed.
zh_cn: 保存与该适配器及其页面相关联的任何实例状态，如果需要重建当前 UI 状态，则应恢复其中的页面。

source: Save memory if possible by using a denser Bitmap.Config at the cost of some image quality.
zh_cn: 如果可能，使用更密集的 Bitmap.Config 以牺牲某些图像质量来节省内存。

source: Save the XML file in your project res/drawable/ folder and then reference it as a drawable for the source of your ImageButton (in the android:src attribute).
zh_cn: 将 XML 文件保存在项目 res/drawable/ 文件夹中，然后将其引用为 ImageButton 源的 drawable(在 android:src 属性中)。

source: Scale in X and Y independently, so that src matches dst exactly.
zh_cn: 独立地在 X 和 Y 中缩放，以便 src 完全匹配 dst。

source: Scale the image uniformly (maintain the image's aspect ratio) so that both dimensions (width and height) of the image will be equal to or larger than the corresponding dimension of the view (minus padding).
zh_cn: 均匀缩放图像(保持图像的纵横比)，使图像的尺寸(宽度和高度)等于或大于 view 的相应尺寸(减去 padding)。

source: Scale the image uniformly (maintain the image's aspect ratio) so that both dimensions (width and height) of the image will be equal to or less than the corresponding dimension of the view (minus padding).
zh_cn: 均匀缩放图像(保持图像的纵横比)，使图像的尺寸(宽度和高度)等于或小于 view 的相应尺寸(减去 padding)。

source: Scale the image using CENTER.
zh_cn: 使用 CENTER 缩放图像。

source: Scale the image using END.
zh_cn: 使用 END 缩放图像。

source: Scale the image using FILL.
zh_cn: 使用 FILL 缩放图像。

source: Scale the image using START.
zh_cn: 使用 START 缩放图像。

source: Scale using the image matrix when drawing.
zh_cn: 绘图时使用图像矩阵缩放。

source: Scale-independent Pixels - This is like the dp unit, but it is also scaled by the user's font size preference.
zh_cn: Scale-independent Pixels（缩放无关像素）- 这与 dp 单位类似，但它也可以根据用户的字体大小首选项进行缩放。

source: Scan children from front to back.
zh_cn: 从前到面扫描子项们。

source: Scrap views may be reused without becoming fully detached from the parent RecyclerView, either unmodified if no rebinding is required or modified by the adapter if the view was considered dirty.
zh_cn: Scrap views 可能会被重复使用，而不会完全脱离父 RecyclerView，在复用时，如果不需要重新绑定，则无需修改；如果 view 被认为是 dirty 的，则会被 adapter 修改。

source: Scroll indicator direction for the bottom edge of the view.
zh_cn: 滚动指示器方向为 view 的下边缘。

source: Scroll indicator direction for the ending edge of the view.
zh_cn: 滚动指示器方向的 view 结束边缘。

source: Scroll indicator direction for the left edge of the view.
zh_cn: 滚动指示器方向为 view 的左边缘。

source: Scroll indicator direction for the right edge of the view.
zh_cn: 滚动指示器方向为 view 的右边缘。

source: Scroll indicator direction for the starting edge of the view.
zh_cn: 滚动指示器方向为 view 的起始边缘。

source: Scroll indicator direction for the top edge of the view.
zh_cn: 滚动指示器方向的顶部边缘。

source: Scroll view may have only one direct child placed within it.
zh_cn: Scroll view 中只能放置一个直接子项。

source: Scroll view supports vertical scrolling only.
zh_cn: Scroll view 仅支持垂直滚动。

source: Scrollers track scroll offsets for you over time, but they don't automatically apply those positions to your view.
zh_cn: Scroller 会随着时间的推移跟踪滚动偏移，但它们不会自动将这些位置应用于 view。

source: Scrolling
zh_cn: 滚动

source: Search in our first-level recycled view cache.
zh_cn: 在我们的一级回收 view 缓存中搜索。

source: Search the first-level cache
zh_cn: 搜索一级缓存

source: Security
zh_cn: 安全性

source: See Tasks and Back Stack for more information about tasks.
zh_cn: 有关任务的详细信息，请参见 Tasks and Back Stack。

source: See Using a Loader to learn how to avoid blocking the main thread when using a cursor.
zh_cn: 请参阅 Using a Loader 以了解如何在使用游标时避免阻塞主线程。

source: See Making ListView Scrolling Smooth for more ways to ensure a smooth user experience.
zh_cn: 有关确保流畅用户体验的更多方法，请参阅 Making ListView Scrolling Smooth。

source: See Keeping Your App Responsive for more details.
zh_cn: 有关详细信息，请参阅 Keeping Your App Responsive。

source: See COLLAPSE_MODE_PARALLAX and setParallaxMultiplier(float).
zh_cn: 参见 COLLAPSE_MODE_PARALLAX 和 setParallaxMultiplier(float)。

source: See FLAG_ACTIVITY_MULTIPLE_TASK for a flag to disable this behavior.
zh_cn: 参见 FLAG_ACTIVITY_MULTIPLE_TASK 了解禁用此行为的标志。

source: See GridLayout.LayoutParams for a full description of the layout parameters used by GridLayout.
zh_cn: 有关 GridLayout 使用的布局参数的完整说明，请参阅 GridLayout.LayoutParams。

source: See LinearLayout.LayoutParams to learn about other attributes you can set on a child view to affect its position and size in the containing linear layout.
zh_cn: 请参阅 LinearLayout.LayoutParams 以了解可在子视图上设置的其他属性，以影响其在包含线性布局中的位置和大小。

source: See ListView, GridView, Spinner and Gallery for commonly used subclasses of AdapterView.
zh_cn: 参见 ListView，GridView，Spinner 和 Gallery，适用于 AdapterView 的常用子类。

source: See scrollBy(int, int), scrollTo(int, int), and awakenScrollBars() for more details.
zh_cn: 查看更多细节，见 scrollBy(int, int)、 scrollTo(int, int) 及 awakenScrollBars()。

source: See setHomeButtonEnabled(boolean).
zh_cn: 参见 setHomeButtonEnabled(boolean)。

source: See setParallaxMultiplier(float) to change the multiplier used.
zh_cn: 参见 setParallaxMultiplier(float) 以更改使用的乘数。

source: See COLLAPSE_MODE_PIN.
zh_cn: 参见 COLLAPSE_MODE_PIN。

source: See useAnchoringBounds and useTransparentBounds for more details.
zh_cn: 有关此内容更多的信息，请参阅 useAnchoringBounds 和 useTransparentBounds for more details.

source: See TabLayout for more information on how to use it.
zh_cn: 有关如何使用它的更多信息，请参见 TabLayout。

source: See all API classes.
zh_cn: 查看所有的 API classes。

source: See all API packages.
zh_cn: 查看所有的 API packages.

source: See also FLAG_WINDOW_IS_OBSCURED.
zh_cn: 参见 FLAG_WINDOW_IS_OBSCURED。

source: See also MotionEvent#FLAG_WINDOW_IS_OBSCURED.
zh_cn: 另请参见 MotionEvent#FLAG_WINDOW_IS_OBSCURED。

source: See also:
zh_cn: 另请参见：

source: See that method for more details.
zh_cn: 有关详细信息，请参阅该方法。

source: See the Buttons guide.
zh_cn: 请参阅 Buttons 指南。

source: See the Checkboxes guide.
zh_cn: 请参阅 Checkboxes 指南。

source: See the Grid View guide.
zh_cn: 请参阅 Grid View 指南。

source: See the Linear Layout guide.
zh_cn: 请参见 Linear Layout 指南。

source: See the Pickers guide.
zh_cn: 请参阅 Pickers 指南。

source: See the Radio Buttons guide.
zh_cn: 请参阅 Radio Buttons 指南。

source: See the Relative Layout guide.
zh_cn: 请参阅 Relative Layout 指南。

source: See the Spinners guide.
zh_cn: 请参阅 Spinners 指南。

source: See the Text Fields guide for examples of other R.styleable.TextView_inputType settings.
zh_cn: 有关其他 R.styleable.TextView_inputType 设置的示例，请参阅 Text Fields 指南。

source: See the Text Fields guide.
zh_cn: 请参阅 Text Fields 指南。

source: See the Toggle Buttons guide.
zh_cn: 请参阅 Toggle Buttons 指南。

source: See the Linear Layout guide for an example.
zh_cn: 有关示例，请参阅 Linear Layout 指南。

source: See the Pickers guide for more information.
zh_cn: 有关详细信息，请参阅 Pickers 指南。

source: See the Styles and Themes guide to learn how to implement and organize overrides to style-related attributes.
zh_cn: 请参阅 Styles and Themes 指南，了解如何实现和组织与样式相关的属性的重写。

source: See the GLSurfaceViewActivity sample for details.
zh_cn: 更多细节可以查看 GLSurfaceViewActivity sample。

source: See the TableLayout examples in ApiDemos for examples of creating tables in XML.
zh_cn: 有关在 XML 中创建表的示例，请参阅 ApiDemos 中的 TableLayout 示例。

source: See the framework Fragment documentation for a class overview.
zh_cn: 见框架的 Fragment 文档以获得概述。

source: See the list of attributes in ConstraintLayout.LayoutParams to set a Guideline in XML, as well as the corresponding setGuidelineBegin(int, int), setGuidelineEnd(int, int) and setGuidelinePercent(int, float) functions in ConstraintSet.
zh_cn: 参阅 ConstraintLayout.LayoutParams 的属性列表来在 XML 中设置一个 Guideline，或者在 ConstraintSet 中调用相应的方法 setGuidelineBegin(int, int)， setGuidelineEnd(int, int) 和 setGuidelinePercent(int, float) 等方法。

source: Select a quality setting for each image you review.
zh_cn: 为你查看的每个图像选择一个质量设置。

source: Select either lossy or lossless encoding.
zh_cn: 选择有损或无损编码。

source: Selector in a drop down list.
zh_cn: 下拉列表中的选择器。

source: Send accessibility events
zh_cn: 发送辅助功能事件

source: Send accessibility events by calling sendAccessibilityEvent() when appropriate.
zh_cn: 适当时通过调用 sendAccessibilityEvent() 发送辅助功能事件。

source: Separated by a blank line between each major grouping (android, com, junit, net, org, java, javax).
zh_cn: 每个主要分组(android、 com、 junit、 net、 org、 java、 javax)之间用空行隔开。

source: Serving a Content URI to Another App
zh_cn: 将 content URI 提供给另一个应用程序

source: Set (replace) the ImageDecoder.OnPartialImageListener on this object.
zh_cn: 在此对象上设置(替换)ImageDecoder.OnPartialImageListener。

source: Set android:orientation to specify whether child views are displayed in a row or column.
zh_cn: 设置 android:orientation 以指定子 view 是显示在行还是列中。

source: Set X location of the pivot point around which the view will rotate and scale.
zh_cn: 设置 view 将旋转和缩放的中心点的 X 位置。

source: Set X,Y location of the pivot point around which the view will rotate and scale.
zh_cn: 设置 view 将旋转和缩放的中心点的 X，Y 位置。

source: Set Y location of the pivot point around which the view will rotate and scale.
zh_cn: 设置 view 将旋转和缩放的中心点的 Y 位置。

source: Set a Guideline's percent.
zh_cn: 设置 Guideline 的百分比。

source: Set a content description for the collapse button if one is present.
zh_cn: 设置折叠按钮的内容说明(如果存在)。

source: Set a content description for the navigation button if one is present.
zh_cn: 设置导航按钮的内容描述(如果存在)。

source: Set a description of the toolbar's logo.
zh_cn: 设置工具栏 logo 的说明。

source: Set a drawable to draw in the insets area for the status bar.
zh_cn: 设置 drawable 以在状态栏的 insets 区域中绘制。

source: Set a guideline's distance to end.
zh_cn: 设置 guideline 距结束的距离。

source: Set a hint to the system about whether this fragment's UI is currently visible to the user.
zh_cn: 设置一个系统提示，有关 fragment 的界面当前对用户是否可见。

source: Set a listener to respond to menu item click events.
zh_cn: 设置监听器以响应菜单项单击事件。

source: Set a listener to respond to navigation events.
zh_cn: 设置监听器以响应导航事件。

source: Set a logo drawable from a resource id.
zh_cn: 从资源 ID 设置 logo。

source: Set a new adapter to provide child views on demand.
zh_cn: 设置一个新的适配器以根据需要提供子视图。

source: Set an alternate description for the Home/Up action, when enabled.
zh_cn: 启用后，为 Home/Up 操作设置备用说明。

source: Set an alternate drawable to display next to the icon/logo/title when DISPLAY_HOME_AS_UP is enabled.
zh_cn: 当启用 DISPLAY_HOME_AS_UP 时，设置备用 drawable 以显示在图标/徽标/标题旁边。

source: Set display options.
zh_cn: 设置显示选项。

source: Set matchConstraintDefault* default to the wrap content size.
zh_cn: 设置 matchConstraintDefault* 默认包含内容的大小。

source: Set matchConstraintDefault* spread as much as possible within its constraints.
zh_cn: 设置 matchConstraintDefault* 在其限制范围内尽可能地展开。

source: Set of layout parameters used in table rows.
zh_cn: 表行中使用的布局参数集。

source: Set selected display options.
zh_cn: 设置选定的显示选项。

source: Set size as a ratio
zh_cn: 将大小设置为比例

source: Set the android:grantUriPermissions attribute to true, to allow you to grant temporary access to files.
zh_cn: 将 android:grantUriPermissions 属性设置为 true ，以允许你授予文件临时访问。

source: Set the RecyclerView.LayoutManager that this RecyclerView will use.
zh_cn: 设置该 RecyclerView 将要使用的 RecyclerView.LayoutManager。

source: Set the app:singleLine attribute to constrain the chips to a single horizontal line.
zh_cn: 设置 app:singleLine 属性以将 chip 限制为单行。

source: Set the android:name attribute to android.support.v4.content.FileProvider.
zh_cn: 将 android:name 属性设置给 android.support.v4.content.FileProvider 。

source: Set the <meta-data> element's "android:name" attribute to android.support.FILE_PROVIDER_PATHS.
zh_cn: 将 <meta-data> 元素的 "android:name" 属性设置为 android.support.FILE_PROVIDER_PATHS 。

source: Set the android:authorities attribute to a URI authority based on a domain you control; for example, if you control the domain mydomain.com you should use the authority com.mydomain.fileprovider.
zh_cn: 将 android:authorities 属性设置为基于你控制的域的 URI 权限;例如，如果你控制域 mydomain.com ，则应使用权限 com.mydomain.fileprovider 。

source: Set the android:exported attribute to false; the FileProvider does not need to be public.
zh_cn: 将 android:exported 属性设置为 false ; FileProvider 不需要公开。

source: Set the ActionBar's background.
zh_cn: 设置 ActionBar 的背景。

source: Set the ActionBar's split background.
zh_cn: 设置 ActionBar 的分割背景。

source: Set the ActionBar's stacked background.
zh_cn: 设置 ActionBar 的堆叠背景。

source: Set the Z-axis elevation of the action bar in pixels.
zh_cn: 设置操作栏的 Z 轴高程(以像素为单位)。

source: Set the action bar into custom navigation mode, supplying a view for custom navigation.
zh_cn: 将操作栏设置为自定义导航模式，为自定义导航提供 view。

source: Set the action bar's subtitle.
zh_cn: 设置操作栏的副标题。

source: Set the action bar's title.
zh_cn: 设置操作栏标题。

source: Set the action to ACTION_SEND and put the URI in data by calling setData().
zh_cn: 将动作设置为 ACTION_SEND ，并通过调用 setData() 将数据放入数据中。

source: Set the beginning of the next contour relative to the last point on the previous contour.
zh_cn: 设置下一个轮廓相对于上一个轮廓上最后一个点的开头。

source: Set the beginning of the next contour to the point (x,y).
zh_cn: 将下一个轮廓的开头设置为点(x，y)。

source: Set the behavior governing the layout and interaction of the child view within a parent CoordinatorLayout.
zh_cn: 在父 CoordinatorLayout 中设置管理子 view 的布局和交互的行为。

source: Set the collapse mode.
zh_cn: 设置折叠模式。

source: Set the color to use for the status bar foreground.
zh_cn: 设置用于状态栏前景的颜色。

source: Set the current hide offset of the action bar.
zh_cn: 设置操作栏的当前隐藏偏移量。

source: Set the drawable to use for the status bar foreground drawable.
zh_cn: 将 drawable 设置为用于状态栏前景 drawable。

source: Set the drawable to use for the status bar foreground from resources.
zh_cn: 将 drawable 设置为用于资源的状态栏前景。

source: Set the element's "android:resource" attribute to @xml/file_paths (notice that you don't specify the .xml extension).
zh_cn: 将元素的 'android:resource' 属性设置为 @xml/file_paths (请注意，不要指定 .xml 扩展名)。

source: Set the flags of the window, as per the WindowManager.LayoutParams flags.
zh_cn: 根据 WindowManager.LayoutParams 标志，设置窗口的标志。

source: Set the guideline's distance form the top or left edge.
zh_cn: 设置 guideline 距顶边或左边的距离。

source: Set the icon to display in the 'home' section of the action bar.
zh_cn: 将图标设置为显示在操作栏的“主页”部分中。

source: Set the icon to use for the overflow button.
zh_cn: 设置用于溢出按钮的图标。

source: Set the icon to use for the toolbar's collapse button.
zh_cn: 设置用于工具栏折叠按钮的图标。

source: Set the icon to use for the toolbar's navigation button.
zh_cn: 设置用于工具栏导航按钮的图标。

source: Set the id of this view's anchor.
zh_cn: 设置此 view 的锚点的 ID。

source: Set the interpolator to when scrolling the view associated with this AppBarLayout.LayoutParams.
zh_cn: 设置滚动与此 AppBarLayout.LayoutParams 关联的 view 时使用的插值器。

source: Set the logo to display in the 'home' section of the action bar.
zh_cn: 设置徽标以显示在操作栏的“主页”部分。

source: Set the max height for this view
zh_cn: 设置该 view 的最大高度

source: Set the max width for this view
zh_cn: 设置该 view 的最大宽度

source: Set the min height for this view
zh_cn: 设置该 view 的最小高度

source: Set the min width for this view
zh_cn: 设置该 view 的最小宽度

source: Set the number of offscreen views to retain before adding them to the potentially shared recycled view pool.
zh_cn: 设置离屏的 view 保存的数量，当它们被添加到可能的共享的 recycled view pool 之前。

source: Set the parallax scroll multiplier used in conjunction with COLLAPSE_MODE_PARALLAX.
zh_cn: 设置与 COLLAPSE_MODE_PARALLAX 一起使用的视差滚动乘数。

source: Set the path's fill type.
zh_cn: 设置路径的填充类型。

source: Set the scrolled position of your view.
zh_cn: 设置该 view 的滚动位置。

source: Set the scrolling flags.
zh_cn: 设置滚动标志。

source: Set the shader's local matrix.
zh_cn: 设置 shader 的局部矩阵。

source: Set the stroke color using the app:strokeColor attribute, which accepts either a color or a color state list.
zh_cn: 使用 app:strokeColor 属性设置 stroke 颜色，该属性接受颜色或颜色状态列表。

source: Set the stroke color using the strokeColor attribute.
zh_cn: 使用 strokeColor 属性设置 stroke 颜色。

source: Set the subtitle of this toolbar.
zh_cn: 设置此工具栏的副标题。

source: Set the target size with a sampleSize.
zh_cn: 使用 sampleSize 设置目标大小。

source: Set the title of this toolbar.
zh_cn: 设置此工具栏的标题。

source: Set this flag if selecting the 'home' button in the action bar to return up by a single level in your UI rather than back to the top level or front page.
zh_cn: 如果选择操作栏中的“主页”按钮时，只在 UI 中按单个级别返回，而不是返回到顶级或首页，则设置此标记

source: Set this if the view will serve as a scrolling container, meaning that it can be resized to shrink its overall window so that there will be space for an input method.
zh_cn: 如果 view 将用作滚动容器，则设置此项，这意味着可以调整其大小以缩小其整个窗口，以便为输入方法提供空间。

source: Set this path to the result of applying the Op to the two specified paths.
zh_cn: 将此路径设置为将 Op 应用于两个指定路径的结果。

source: Set this path to the result of applying the Op to this path and the specified path.
zh_cn: 将此路径设置为将 Op 应用于此路径和指定路径的结果。

source: Set this to true if you want the ImageView to adjust its bounds to preserve the aspect ratio of its drawable.
zh_cn: 如果希望 ImageView 调整其边界以保持其 drawable 的纵横比，请将此属性设置为 true。

source: Set up a ValueAnimator to animate for the duration of the fling, and add a listener to process animation updates by calling addUpdateListener().
zh_cn: 设置 ValueAnimator 以在 fling 持续时间内设置动画，并通过调用 addUpdateListener()。

source: Set whether a custom view should be displayed, if set.
zh_cn: 设置是否应显示自定义 view(如果已设置)。

source: Set whether an activity title/subtitle should be displayed.
zh_cn: 设置是否应显示 activity 标题/副标题。

source: Set whether home should be displayed as an "up" affordance.
zh_cn: 设置是否应将主页显示为“向上”功能。
